#+TITLE: Optimizing For Hardware Caches
#+AUTHOR: Lukas Waymann

#+LANGUAGE: en
#+REVEAL_THEME: night
#+REVEAL_EXTRA_CSS: extra.css
#+REVEAL_HIGHLIGHT_CSS: ir-black.css
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_DEFAULT_FRAG_STYLE: appear
#+OPTIONS: reveal_control:nil num:nil toc:nil reveal_title_slide:"<h1>%t</h1>"

# XXX: this only works when `org-export-allow-bind-keywords` is non-`nil`.  See
# http://orgmode.org/org.html#index-g_t_0023_002bBIND-1631
#+BIND: org-html-metadata-timestamp-format "%Y-%m-%d"

** Result
   #+NAME: get-speedup
   #+BEGIN_SRC bash :exports none :cache yes :results output verbatim
   awk '{ print int($1+0.5) }' ../ithare/speedup.txt 
   #+END_SRC

   #+RESULTS[097a81ed9983614afb304cf7c0ebbe986c1411de]: get-speedup
   : 152

   #+ATTR_REVEAL: :frag (none appear)
   - Computing the sum runs call_get-speedup() {{{results(=152=)}}}
     times faster when using ~std::vector~
   - The list has /some/ space overhead since it stores two pointers and
     some more overhead because of indirection
   - The more cache-friendly access pattern of ~std::vector~ is decisive, though

